In [0]:
# Author : Karthikeyan V
# Stack Overflow Case Study
# import the Python Libraries
import pandas as pd
import numpy as py
import matplotlib.pyplot as plt

In [0]:
# read the Questions Dataset stored in AWS S3 public storage 
inpQues = pd.read_csv("https://stack-overflow-casestudy-datasets.s3.amazonaws.com/Questions.csv", encoding="ISO-8859-1")

In [0]:
# read the Question Tags Dataset stored in AWS S3 public storage
inpQuesTags = pd.read_csv("https://stack-overflow-casestudy-datasets.s3.amazonaws.com/Tags.csv", encoding="ISO-8859-1")

In [0]:
# read the Answers Dataset stored in AWS S3 public storage 
inpAns = pd.read_csv("https://stack-overflow-casestudy-datasets.s3.amazonaws.com/Answers.csv", encoding="ISO-8859-1")

In [0]:
# read the Users Dataset stored in AWS S3 public storage 
inpUsers = pd.read_csv("https://stack-overflow-casestudy-datasets.s3.amazonaws.com/Users.csv", encoding="ISO-8859-1")

In [7]:
inpQues.head(5)

    Id  ...                                               Body
0   80  ...  <p>I've written a database generation script i...
1   90  ...  <p>Are there any really good tutorials explain...
2  120  ...  <p>Has anyone got experience creating <strong>...
3  180  ...  <p>This is something I've pseudo-solved many t...
4  260  ...  <p>I have a little game written in C#. It uses...

[5 rows x 7 columns]

In [8]:
inpQues.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1264216 entries, 0 to 1264215
Data columns (total 7 columns):
Id              1264216 non-null int64
OwnerUserId     1249762 non-null float64
CreationDate    1264216 non-null object
ClosedDate      55959 non-null object
Score           1264216 non-null int64
Title           1264216 non-null object
Body            1264216 non-null object
dtypes: float64(1), int64(2), object(4)
memory usage: 67.5+ MB

In [9]:
inpQuesTags.head(100)

      Id             Tag
0     80            flex
1     80  actionscript-3
2     80             air
3     90             svn
4     90     tortoisesvn
..   ...             ...
95  2770  error-handling
96  2770   user-controls
97  2780              c#
98  2780          colors
99  2840             sql

[100 rows x 2 columns]

In [10]:
inpQues.describe()

                 Id   OwnerUserId         Score
count  1.264216e+06  1.249762e+06  1.264216e+06
mean   2.132745e+07  2.155177e+06  1.781537e+00
std    1.151445e+07  1.801265e+06  1.366389e+01
min    8.000000e+01  1.000000e+00 -7.300000e+01
25%    1.142598e+07  6.589110e+05  0.000000e+00
50%    2.172542e+07  1.611830e+06  0.000000e+00
75%    3.154542e+07  3.353792e+06  1.000000e+00
max    4.014338e+07  7.046594e+06  5.190000e+03

In [11]:
inpAns.head(25)

      Id  OwnerUserId  ... Score                                               Body
0     92         61.0  ...    13  <p><a href="http://svnbook.red-bean.com/">Vers...
1    124         26.0  ...    12  <p>I wound up using this. It is a kind of a ha...
2    199         50.0  ...     1  <p>I've read somewhere the human eye can't dis...
3    269         91.0  ...     4  <p>Yes, I thought about that, but I soon figur...
4    307         49.0  ...    28  <p><a href="http://www.codeproject.com/Article...
5    332         59.0  ...    19  <p>I would be a bit reluctant to use nested cl...
6    344        100.0  ...     6  <p>You might be able to use IronRuby for that....
7    359        119.0  ...     5  <P>You could use any of the DLR languages, whi...
8    473         49.0  ...     8  <p>No, what you're doing is fine. Don't let th...
9    529         86.0  ...     3  <p>Isn't it also a factor which order you set ...
10   539        157.0  ...    21  <p>My first thought on this is "how generate N...
11   585        149.0  ...    13  <p>For my projects I alternate between SQL Com...
12   586         34.0  ...    17  <p>I've taken to hand-coding all of my DDL (cr...
13   590        116.0  ...     2  <p>If you have a company buying it, Toad from ...
14   591        111.0  ...     3  <p>I work the same way Karl does, by keeping a...
15   597         76.0  ...     1  <p>I agree that scripting everything is the be...
16   655         91.0  ...    69  <p>With the "Built in" stuff, you can't, as us...
17   787        175.0  ...     4  <p>What source control system are you using? <...
18   818        233.0  ...     0  <p>I'm partway to my solution with this entry ...
19   820         91.0  ...     3  <p>First: Yes, this is something that belongs ...
20   829        234.0  ...     4  <p>I'm guessing that because you want to set i...
21   870        233.0  ...     0  <p>Despite what the <a href="http://msdn.micro...
22   940        243.0  ...    15  <p>Very roughly and from memory since I don't ...
23   951         49.0  ...    26  <p>@Goyuix -- that's excellent for something w...
24  1022         93.0  ...     9  <p>That's definitely a good way to do it.  But...

[25 rows x 6 columns]

In [12]:
#Data Handling and Cleaning
inpQues.isnull().sum()

Id                    0
OwnerUserId       14454
CreationDate          0
ClosedDate      1208257
Score                 0
Title                 0
Body                  0
dtype: int64

In [13]:
inpUsers.tail(5)

         Unnamed: 0       id      display_name  ... up_votes down_votes  views
1990475     1990475  4228492  Michael Spranger  ...      112          2     17
1990476     1990476  6820506           Manuela  ...       38          0     50
1990477     1990477  4464432            YTorii  ...       67          1     13
1990478     1990478  4605946     space_voyager  ...       53          1    191
1990479     1990479  6107989         Nicky HFE  ...        0          0     30

[5 rows x 9 columns]

In [14]:
# Display the Question records whose  OwnerUserId is null
inpQues[inpQues["OwnerUserId"].isnull()]

               Id  ...                                               Body
47           4170  ...  <p>I need to learn ADO.NET to build applicatio...
130         12330  ...  <p>Hey everyone, \nIs there any known way of l...
158         15190  ...  <p>I have a project group that contains a proj...
198         18250  ...  <p>The creation date of an executable linked i...
300         29100  ...  <p>I came across a printed <a href="http://www...
...           ...  ...                                                ...
1261359  40076260  ...  <p>My function takes two objects that represen...
1261501  40079260  ...  <p><a href="http://i.stack.imgur.com/M2EV8.png...
1263664  40130890  ...  <p><div class="snippet" data-lang="js" data-hi...
1263908  40136590  ...  <p>In <strong>my_data</strong> I want to creat...
1264010  40138620  ...  <p>I have iMac and my bash on terminal has .ba...

[14454 rows x 7 columns]

In [15]:
inpQuesTags["Tag"].value_counts()

javascript           124155
java                 115212
c#                   101186
php                   98808
android               90659
                      ...
sencha-cmd5               1
toolrunner                1
order-create-hook         1
matrix-transform          1
ncron                     1
Name: Tag, Length: 37034, dtype: int64

In [0]:
inpQuesTags.sort_values("Tag", axis = 0, ascending = True, inplace = True, na_position ='last')

In [19]:
inpQuesTags.head(5)

               Id Tag
459374    6267900  .a
152175    2488400  .a
1266993  15292510  .a
2218583  25550490  .a
2091204  24225810  .a

In [0]:
inpQuesTagsDataScience = inpQuesTags[(inpQuesTags.values  == "r")|(inpQuesTags.values  == "matlab")|(inpQuesTags.values  == "excel")|(inpQuesTags.values  == "sql")|(inpQuesTags.values  == "sas")|(inpQuesTags.values  == "python")]

In [29]:
inpQuesTagsDataScience.Tag.value_counts()

python    64601
sql       35782
r         15701
excel     10384
matlab     6495
sas         697
Name: Tag, dtype: int64

In [30]:
inpQuesTagsDataScience.count

<bound method DataFrame.count of                Id    Tag
3058142  33994160  excel
2399669  27441750  excel
2181115  25160000  excel
3747014  40110970  excel
807786   10221150  excel
...           ...    ...
2987422  33363240    sql
3748578  40124300    sql
1310169  15773080    sql
1429491  17101640    sql
1119595  13657570    sql

[133660 rows x 2 columns]>

In [37]:
inpQuesTagsDataScience.head(15)

               Id    Tag
3058142  33994160  excel
2399669  27441750  excel
2181115  25160000  excel
3747014  40110970  excel
807786   10221150  excel
2557110  29060790  excel
2417841  27637670  excel
2958621  33098690  excel
3392732  37027660  excel
2651574  30022200  excel
2680704  30318230  excel
1086879  13298300  excel
3472223  37740240  excel
3601396  38876370  excel
2180854  25156760  excel

In [36]:
inpQuesTagsDataScience[inpQuesTagsDataScience.Tag.isnull()]

Empty DataFrame
Columns: [Id, Tag]
Index: []

In [38]:
inpQuesTagsDataScience.tail(15)

               Id  Tag
758022    9669150  sql
2144116  24777320  sql
2755022  31061840  sql
414046    5739770  sql
1513183  18021110  sql
2372844  27160140  sql
2849404  32005280  sql
3616042  39006450  sql
1663216  19663690  sql
1897670  22195350  sql
2987422  33363240  sql
3748578  40124300  sql
1310169  15773080  sql
1429491  17101640  sql
1119595  13657570  sql

In [40]:
inpQuesTagsDataScience.Id.value_counts()

35918200    3
29325500    3
12679530    3
18614630    3
31948740    3
           ..
37027520    1
6977690     1
14567580    1
29337760    1
39321600    1
Name: Id, Length: 132075, dtype: int64

In [46]:
inpQuesTagsDataScience.loc[inpQuesTagsDataScience['Id'] == 35918200]

               Id     Tag
3269827  35918200  matlab
3269825  35918200  python
3269826  35918200       r

In [47]:
inpQuesTagsDataScience.loc[inpQuesTagsDataScience['Id'] == 29325500]

               Id     Tag
2582988  29325500   excel
2582989  29325500  matlab
2582987  29325500       r

In [48]:
inpQuesTagsDataScience.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 133660 entries, 3058142 to 1119595
Data columns (total 2 columns):
Id     133660 non-null int64
Tag    133660 non-null object
dtypes: int64(1), object(1)
memory usage: 3.1+ MB